---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralWallTopProjectionPlane
source: html/c583f25e-1034-a7f0-0d72-d7ad7ea53e9f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralWallTopProjectionPlane Property

"Top Vertical Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralWallTopProjectionPlane { get; }
```